<script setup>
import { firstHelp, wind, science, memoryWar } from '../utils/newsPhotoArray';
import { newsList } from '~/utils/api/api';

definePageMeta({
    layout: "header",
})
const array = ref([]);

newsList()
    .then((res) => {
        array.value = res.reverse();
    })
    .catch((e) => console.log(e))

</script>
<template>
    <ClientOnly>
        <main class="content">
            <section class="news">
                <NewsBox :date="data.date" :text="data.description" :header="data.name" :photoArray="data.photo"
                    v-for="data in array" />
                <NewsBox :date="'18.01.2023'"
                    :text="'Мастер-класс по оказанию первой помощи на заседании РМО педагогов по воспитательной работе Исетского района РДДМ- территория возможностей. Говорили про Ожоги Инородные тела в верхних дыхательных путях СЛР'"
                    :header="'Мастер-класс по оказанию первой помощи'" :photoArray="firstHelp" />
                <NewsBox :date="'18.02.2022'"
                    :text="'Дети учились строить Розу ветров, а на практической части на улице учились определять направление ветра, и его скорость. Ветер в этот день практически отсутствовал, средняя скорость была 1 м/сек.'"
                    :header="'18.02.2022 на уроке географии в 6 классах изучали тему Ветер.'" :photoArray="wind" />
                <NewsBox :date="'15.02.2022'"
                    :text="`Обсуждали понятие слова Война, говорили о страшном явлении в жизни любого народа, целях войны и последствиях её для всех сторон. Война в Афганистане носила миротворческой характер, но сколько бед в жизнь советских семей она принесла. А ведь именно  В этот день командующий ограниченным контингентом генерал-лейтенант Борис Всеволодович
                                                                                                                                                                                                                                                                                                                Громов, спрыгнув с бронетранспортёра, пересёк мост, символизируя этим, что он последним
                                                                                                                                                                                                                                                                        перешёл пограничную реку Амударья (г. Термез), но в реальности последними Афганистан
                                                                                                                                                                покинули подразделения пограничников и спецназа, прикрывавшие вывод войск и вышедшие на
                                                                                                                                                                территорию СССР только во второй половине дня 15 февраля. Это событие ознаменовало для
                                                                                                                                                                Советского Союза окончание Афганской войны, которая продлилась девять лет и унесла жизни
                                                                                                                                                                более 15 тысяч советских граждан.`"
                    :header="`14 и 15 февраля в 7 б, 6 А и 9-ых классах прошли классные часы на тему Память об Афганской войне.`"
                    :photoArray="memoryWar" />
                <NewsBox :date="'08.02.2022'" :text="'Запустили челендж ко Дню науки 8 февраля.'"
                    :header="'1Запустили челендж ко Дню науки 8 февраля.'" :photoArray="science" />

            </section>
        </main>
    </ClientOnly>
</template>

<style lang="scss">
.news {
    display: flex;
    flex-direction: column;
    max-width: 1024px;
    background-color: $grey;
    border-top-left-radius: 15px;
    border-top-right-radius: 15px;
    margin: 40px auto 0 auto;
}
</style>